// x : 恥ずかし度
// y : テンションの低さ

var bCommandList = [
	{
        text : "勇者Ｆは、ねずみ戦士を可愛く着せ替えた！",
		variation : [ // 着せ替える
			{ dy :  0, dx :  1, text : "ばっばかやろうっ。俺は男だぞッ！？" },
			{ dy :  0, dx :  1, text : "こ、この俺に恥かかせたコト後悔させてやる‥。" },
			{ dy :  1, dx :  0, text : "しつこい。" },
		]
	},
	{
        text : "勇者Ｆは、ねずみ戦士をやさしく撫でた！",
		variation : [ // なでる
			{ dy :  0, dx :  1, text : "お‥‥おい‥‥ッ！" },
			{ dy : -1, dx :  1, text : "やめ‥‥やめ‥‥ッ！" },
			{ dy : -1, dx :  0, text : "ぁぁ‥‥ッ！" },
		]
	},
	{
        text : "勇者Ｆは、ねずみ戦士に手作りのお菓子を渡した！",
		variation : [ // お菓子をあげる
			{ dy : -1, dx :  0, text : "え‥‥。‥‥貰うけど。もぐもぐ‥‥。" },
			{ dy : -1, dx :  0, text : "味は悪くねーな。まだくれるのか？" },
			{ dy :  0, dx :  0, text : "さすがにもういらねーよ！" },
		]
	},
	{
        text : "勇者Ｆは、ねずみ戦士のカラダ中をこちょばした！",
		variation : [ // くすぐる
			{ dy :  1, dx :  0, text : "わっ‥‥ぐっ！？　ぎゃ　ぎゃはははは‥‥！" },
			{ dy :  0, dx :  1, text : "ひいっ　ばかやめろッ‥‥！？　ぎゃははは、ひーひーっ。" },
			{ dy :  1, dx :  0, text : "はあっ　はぁっ　し、しつけーぞッ‥‥ぐぐっ‥‥ぐはははは！" },
		]
	},
	{
        text : "勇者Ｆは、ねずみ戦士をふわりと抱き上げた！",
		variation : [ // 抱き上げる
			{ dy :  0, dx :  1, text : "やめろ　テメェ何しやが‥‥ッ！" },
			{ dy :  0, dx :  1, text : "さ、さわるな、きもちわるい‥‥。" },
			{ dy : -1, dx :  1, text : "‥‥‥‥。" },
		]
	},
	{
        text : "勇者Ｆは、ねずみ戦士を口説いた！",
		variation : [ // 口説く
			{ dy : -1, dx :  1, text : "だあっ！？　何言い出すんだ突然！？" },
			{ dy :  0, dx :  0, text : "同じことを今さっき聞いたぞ。" },
		]
	},
	{
        text : "勇者Ｆは、ねずみ戦士にキツいお説教をした‥‥。",
		variation : [ // お説教をする
			{ dy :  1, dx :  0, text : "う、うるせーよ‥‥。俺だって色々あったんだよ‥‥。" },
			{ dy :  1, dx : -1, text : "えぐっ　分かったって言ってんだろぉ！？　あぁああああん‥‥。" },
		]
	},
	{
        text : "勇者Ｆは、ねずみ戦士を物置きに閉じ込めてカギを締めた‥‥。",
		variation : [ // 物置に閉じ込める
			{ dy :  2, dx :  0, text : "は‥‥！？　ちょっと待て‥‥出せ！！　出せ！！！（バンバンバン）" },
			{ dy :  1, dx : -1, text : "あぁあああ暗いよぉおお　開けろよぉおおおおッ！！！（ドンドン）" },
			{ dy :  1, dx :  0, text : "うわあぁあああひぐっ‥‥‥‥ぐすっ‥‥ぐすっ‥‥。"  },
		]
	},
];

var ax = [
    [ 0 ,-2 ,-3 ,-2 , 1 ],
    [ 0 , 0 ,-1 ,-1 , 1 ],
    [ 0 , 0 ,-1 , 1 , 0 ],
    [ 0 , 1 , 0 , 0 ,-1 ],
    [ 1 , 0 , 1 , 0 ,-2 ],
]
